// - Є змінна х, якій ви надаєте довільне числове значення.
// Якщо змінна x не дорівнює нулю, виведіть 'Вірно',
// інакше виведіть 'Невірно'.

let x = 1;
if (x !== 0) {
    console.log('Вірно')
}
else {
    console.log('Невірно')
}

// Перевірте скрипт при a, що дорівнює 1, 0, -3

// let a = prompt('Введіть довільне число');
// a = +a;
// switch (a) {
//     case 0:
//         console.log('Вірно');
//         break;
//     case 1:
//         console.log('Невірно');
//         break;
//     case -3:
//         console.log('Невірно');
//         break;
//
//     default:
//         console.log('Не ті цифри');
//         break;
// }


// - Дано змінну time яка рівна числу від 0 до 59.
// Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю чи четверту частину години).

// let time = prompt('Поточні хвилини');
// time = +time;
// if (time >= 0 && time < 16) {
//     console.log('Перша чверть');
// }
// else if (time >= 16 && time < 30 ) {
//     console.log('Друга чверть');
// }
// else if (time >= 30 && time < 45) {
//     console.log('Третя чверть')
// }
// else if (time >= 45 && time <= 59) {
//     console.log('четверта чверть')
// }
// else {
//     console.log('Це число не використовується для визначення хвилин')
// }

// - У змінній day дано якесь число від 1 до 31.
// Потрібно визначити, у яку половину(декаду) місяця потрапляє
// це число (у першу, другу чи третю).

// let day = prompt('Який сьогодні день місяця?');
// day = +day;
// if (day >=1 && day <= 10) {
//     console.log('Сьогодні перша декада місяця');
// }
// else if (day > 10 && day <= 20) {
//     console.log('Сьогодні друга декада місяця');
// }
// else if (day > 20 && day <= 31) {
//     console.log('Сьогодні третя декада місяця');
// }
// else {
//     console.log('Це не число місяця')
// }

// - Скласти розклад на тиждень за домопоги switch.
// Користувач вводить порядковий номер дня тижня і на екрані
// відображається інфа що заплановано на цей день
// (можна замість плану на день, назву дня англійською).

// let schedule = prompt ('Який сьогодні день тижня?');
// switch (schedule) {
//     case 'monday':
//         console.log('Зроби те, що маєш зробити в понеділок');
//         break;
//     case 'tuesday':
//         console.log('Зроби те, що маєш зробити у вівторок');
//         break;
//     case 'wednesday':
//         console.log('Зроби те, що маєш зробити у середу');
//         break;
//     case 'thursday':
//         console.log('Зроби те, що маєш зробити у четвер');
//         break;
//     case 'friday':
//         console.log('Зроби те, що маєш зробити у п\'ятницю');
//         break;
//     case 'saturday':
//         console.log('Зроби те, що маєш зробити у суботу');
//         break;
//     case 'sunday':
//         console.log('Відпочивай!')
//         break;
// }

// - Користувач вводить або має два числа.
// Потрібно знайти та вивести максимальне число з тих двох .
// Також потрібно врахувати коли введені рівні числа.

// let a = prompt('Введи перше число');
// let b = prompt('Введи друге число');
// if (a > b) {
//     console.log(a);
// }
// else if(b > a) {
//     console.log(b);
// }
// else {
//     console.log('Числа рівні');
// }

// - Є змінна х, яка може прийняти будь-яке значення
// (стрінг, число, undefined, null  і тд включно).
// Напишіть код який, за допомоги оператора || буде присвоювати змінній х значення "default"
// якщо значення змінної х являється falsy (хибноподібне, тобто кастується до false)

// let x = prompt("jhh") || "default";
// console.log(x);

